Cases/Case3_Wang/output/Cases_Geo2_60/Basic_model/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (1.366 0 0);
    }
    
    outlet
    {
        type            zeroGradient;
    }
    
    upWall
    {
        type		noSlip;
    }
    
    floorWall
    {
        type		noSlip;
    }
    
    northWall
    {
        type		noSlip;
    }
    
    southWall
    {
        type		noSlip;
    }
    
    eastWall
    {
        type		empty;
    }
    
    westWall
    {
        type		empty;
    }
    
    interWall
    {
    	type		noSlip;
    }
}

// ************************************************************************* //
