Cases/Case3_Wang/output/Cases_Geo2_60/Basic_model/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }
    
    outlet
    {
        type		fixedValue;
	value           $internalField;
    }
    
    upWall
    {
        type            zeroGradient;
    }
    
    floorWall
    {
        type            zeroGradient;
    }
    
    northWall
    {
        type            zeroGradient;
    }
    
    southWall
    {
        type            zeroGradient;
    }
    
    eastWall
    {
        type		empty;
    }
    
    westWall
    {
        type		empty;
    }
    
    interWall
    {
    	type		zeroGradient;
    }
}


// ************************************************************************* //
