Cases/Case3_Wang/output/Cases_Geo2_60/Basic_model/system/slicing
/*--------------------------------*- C++ -*----------------------------------*\
=========                 |
\\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
 \\    /   O peration     | Website:  https://openfoam.org
  \\  /    A nd           | Version:  10
   \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
Writes graph data for specified fields along a line or a surface, specified by start and
end points. A specified number of graph points are used, distributed
uniformly along the line.
\*---------------------------------------------------------------------------*/

slicing
{
    type                  surfaces;
    libs                  ("libsampling.so");
    writeControl          writeTime;
    surfaceFormat         raw;
//    fields                (U T);
    fields                (U);
    interpolationScheme   cellPoint;
    surfaces
        (
            zMiddle
            {
                type          cuttingPlane;
                planeType     pointAndNormal;
                point         (0 0 0.005);
                normal        (0 0 1);
                interpolate   true;    
            }
        );
}

// ************************************************************************* //
